app/controllers/api/arenas_controller.rb

    def index
        @arenas = Arena.all
---
SELECT "arenas".* FROM "arenas" WHERE (lat < '40.81472518233505' AND lat > '40.657684141894' AND lng > '-74.06006101722528' AND lng < '-73.92038498277475')

    def show
        @arena = Arena.find(params[:id])
---
SELECT  "arenas".* FROM "arenas" WHERE "arenas"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]