app/controllers/api/bookings_controller.rb

    def index
        @bookings = User.find(params[:user_id]).bookings
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]

    def create
        @booking = Booking.new(booking_params)

        if @booking.save
---
INSERT INTO "bookings" ("hooper_id", "arena_id", "date", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"