app/views/api/bookings/index.json.jbuilder

            json.partial! 'api/arenas/arena', arena: booking.arena
            json.photoUrls booking.arena.photos.map { |file| url_for(file)}
---
SELECT  "arenas".* FROM "arenas" WHERE "arenas"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]