app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ballislife6"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = user.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "oV2u-IxAN_9Q6ZXqaB8CwA"], ["updated_at", "2020-04-07 15:35:49.052356"], ["id", 5]]
---
    def reset_session_token!
        self.update!(session_token: User.generate_session_token)